# HideCategoriesTemporary Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..HideCategoriesTemporary Method
View Class See Also
---
Set multiple categories to be temporarily hidden in the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void HideCategoriesTemporary(
	ICollection<ElementId> elementIds
)
```

Visual Basic
---
```text
Public Sub HideCategoriesTemporary ( _
	elementIds As ICollection(Of ElementId) _
)
```

Visual C++
---
```text
public:
void HideCategoriesTemporary(
	ICollection<ElementId^>^ elementIds
)
```

# ### Parameters
elementIds
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> Ids of the categories to be hidden
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Some elements in elementIds do not correspond to a Category. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
View Class
Autodesk.Revit.DB Namespace